Revit 2027 API
PlanTopologySet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	PlanTopology item
)
Public Overridable Function Erase (
	item As PlanTopology
) As Integer
public:
virtual int Erase(
	PlanTopology^ item
)
abstract Erase :
        item : PlanTopology -> int
override Erase :
        item : PlanTopology -> int
Parameters
item PlanTopology
The item to be erased.
Return Value
Int32
The number of items that were erased from the set.
See Also
Reference
PlanTopologySet Class
Autodesk.Revit.DB Namespace